In [ ]:
pip install ipython-sql

In [1]:
%load_ext sql

In [17]:
%sql sqlite:////Users/adara/module3/dsc-mod-3-project-atlanta-ds-091619/Northwind_small.sqlite

'Connected: @/Users/adara/module3/dsc-mod-3-project-atlanta-ds-091619/Northwind_small.sqlite'

In [22]:
%sql SELECT name, sql FROM sqlite_master WHERE type ='table' ORDER BY name;

   sqlite://
 * sqlite:////Users/adara/module3/dsc-mod-3-project-atlanta-ds-091619/Northwind_small.sqlite
Done.

[('Category', 'CREATE TABLE "Category" \n(\n  "Id" INTEGER PRIMARY KEY, \n  "CategoryName" VARCHAR(8000) NULL, \n  "Description" VARCHAR(8000) NULL \n)'),
 ('Customer', 'CREATE TABLE "Customer" \n(\n  "Id" VARCHAR(8000) PRIMARY KEY, \n  "CompanyName" VARCHAR(8000) NULL, \n  "ContactName" VARCHAR(8000) NULL, \n  "Conta ... (113 characters truncated) ... R(8000) NULL, \n  "PostalCode" VARCHAR(8000) NULL, \n  "Country" VARCHAR(8000) NULL, \n  "Phone" VARCHAR(8000) NULL, \n  "Fax" VARCHAR(8000) NULL \n)'),
 ('CustomerCustomerDemo', 'CREATE TABLE "CustomerCustomerDemo" \n(\n  "Id" VARCHAR(8000) PRIMARY KEY, \n  "CustomerTypeId" VARCHAR(8000) NULL \n)'),
 ('CustomerDemographic', 'CREATE TABLE "CustomerDemographic" \n(\n  "Id" VARCHAR(8000) PRIMARY KEY, \n  "CustomerDesc" VARCHAR(8000) NULL \n)'),
 ('Employee', 'CREATE TABLE "Employee" \n(\n  "Id" INTEGER PRIMARY KEY, \n  "LastName" VARCHAR(8000) NULL, \n  "FirstName" VARCHAR(8000) NULL, \n  "Title" VARCHAR(8 ... (339 characters truncated) ... sion" VARCHAR(8000) NULL, \n  "Photo" BLOB NULL, \n  "Notes" VARCHAR(8000) NULL, \n  "ReportsTo" INTEGER NULL, \n  "PhotoPath" VARCHAR(8000) NULL \n)'),
 ('EmployeeTerritory', 'CREATE TABLE "EmployeeTerritory" \n(\n  "Id" VARCHAR(8000) PRIMARY KEY, \n  "EmployeeId" INTEGER NOT NULL, \n  "TerritoryId" VARCHAR(8000) NULL \n)'),
 ('Order', 'CREATE TABLE "Order" \n(\n  "Id" INTEGER PRIMARY KEY, \n  "CustomerId" VARCHAR(8000) NULL, \n  "EmployeeId" INTEGER NOT NULL, \n  "OrderDate" VARCHAR ... (227 characters truncated) ... "ShipCity" VARCHAR(8000) NULL, \n  "ShipRegion" VARCHAR(8000) NULL, \n  "ShipPostalCode" VARCHAR(8000) NULL, \n  "ShipCountry" VARCHAR(8000) NULL \n)'),
 ('OrderDetail', 'CREATE TABLE "OrderDetail" \n(\n  "Id" VARCHAR(8000) PRIMARY KEY, \n  "OrderId" INTEGER NOT NULL, \n  "ProductId" INTEGER NOT NULL, \n  "UnitPrice" DECIMAL NOT NULL, \n  "Quantity" INTEGER NOT NULL, \n  "Discount" DOUBLE NOT NULL \n)'),
 ('Product', 'CREATE TABLE "Product" \n(\n  "Id" INTEGER PRIMARY KEY, \n  "ProductName" VARCHAR(8000) NULL, \n  "SupplierId" INTEGER NOT NULL, \n  "CategoryId" INT ... (92 characters truncated) ... n  "UnitsInStock" INTEGER NOT NULL, \n  "UnitsOnOrder" INTEGER NOT NULL, \n  "ReorderLevel" INTEGER NOT NULL, \n  "Discontinued" INTEGER NOT NULL \n)'),
 ('Region', 'CREATE TABLE "Region" \n(\n  "Id" INTEGER PRIMARY KEY, \n  "RegionDescription" VARCHAR(8000) NULL \n)'),
 ('Shipper', 'CREATE TABLE "Shipper" \n(\n  "Id" INTEGER PRIMARY KEY, \n  "CompanyName" VARCHAR(8000) NULL, \n  "Phone" VARCHAR(8000) NULL \n)'),
 ('Supplier', 'CREATE TABLE "Supplier" \n(\n  "Id" INTEGER PRIMARY KEY, \n  "CompanyName" VARCHAR(8000) NULL, \n  "ContactName" VARCHAR(8000) NULL, \n  "ContactTitl ... (142 characters truncated) ... HAR(8000) NULL, \n  "Country" VARCHAR(8000) NULL, \n  "Phone" VARCHAR(8000) NULL, \n  "Fax" VARCHAR(8000) NULL, \n  "HomePage" VARCHAR(8000) NULL \n)'),
 ('Territory', 'CREATE TABLE "Territory" \n(\n  "Id" VARCHAR(8000) PRIMARY KEY, \n  "TerritoryDescription" VARCHAR(8000) NULL, \n  "RegionId" INTEGER NOT NULL \n)')]

In [14]:
%%sql
select * from dbo

   sqlite://
 * sqlite:////Users/adara/module3/dsc-mod-3-project-atlanta-ds-091619/Northwind_small.sqlite
(sqlite3.OperationalError) no such table: dbo
[SQL: select * from dbo]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [15]:
%sql show schema

   sqlite://
 * sqlite:////Users/adara/module3/dsc-mod-3-project-atlanta-ds-091619/Northwind_small.sqlite
(sqlite3.OperationalError) near "show": syntax error
[SQL: show schema]
(Background on this error at: http://sqlalche.me/e/e3q8)